MikroElektronika/core_packages/PIC/XC8/def/PIC18F2682/mcu.h
extern volatile RXF6EIDHbits_t RXF6EIDHbits __at(0xD62);
// bitfield macros
#define _RXF6EIDH_EID8_POSN                                 0x0
#define _RXF6EIDH_EID8_POSITION                             0x0
#define _RXF6EIDH_EID8_SIZE                                 0x1
#define _RXF6EIDH_EID8_LENGTH                               0x1
#define _RXF6EIDH_EID8_MASK                                 0x1
#define _RXF6EIDH_EID9_POSN                                 0x1
#define _RXF6EIDH_EID9_POSITION                             0x1
#define _RXF6EIDH_EID9_SIZE                                 0x1
#define _RXF6EIDH_EID9_LENGTH                               0x1
#define _RXF6EIDH_EID9_MASK                                 0x2
#define _RXF6EIDH_EID10_POSN                                0x2
#define _RXF6EIDH_EID10_POSITION                            0x2
#define _RXF6EIDH_EID10_SIZE                                0x1
#define _RXF6EIDH_EID10_LENGTH                              0x1
#define _RXF6EIDH_EID10_MASK                                0x4
#define _RXF6EIDH_EID11_POSN                                0x3
#define _RXF6EIDH_EID11_POSITION                            0x3
#define _RXF6EIDH_EID11_SIZE                                0x1
#define _RXF6EIDH_EID11_LENGTH                              0x1
#define _RXF6EIDH_EID11_MASK                                0x8
#define _RXF6EIDH_EID12_POSN                                0x4
#define _RXF6EIDH_EID12_POSITION                            0x4
#define _RXF6EIDH_EID12_SIZE                                0x1
#define _RXF6EIDH_EID12_LENGTH                              0x1
#define _RXF6EIDH_EID12_MASK                                0x10
#define _RXF6EIDH_EID13_POSN                                0x5
#define _RXF6EIDH_EID13_POSITION                            0x5
#define _RXF6EIDH_EID13_SIZE                                0x1
#define _RXF6EIDH_EID13_LENGTH                              0x1
#define _RXF6EIDH_EID13_MASK                                0x20
#define _RXF6EIDH_EID14_POSN                                0x6
#define _RXF6EIDH_EID14_POSITION                            0x6
#define _RXF6EIDH_EID14_SIZE                                0x1
#define _RXF6EIDH_EID14_LENGTH                              0x1
#define _RXF6EIDH_EID14_MASK                                0x40
#define _RXF6EIDH_EID15_POSN                                0x7
#define _RXF6EIDH_EID15_POSITION                            0x7
#define _RXF6EIDH_EID15_SIZE                                0x1
#define _RXF6EIDH_EID15_LENGTH                              0x1
#define _RXF6EIDH_EID15_MASK                                0x80
#define _RXF6EIDH_RXF6EID8_POSN                             0x0
#define _RXF6EIDH_RXF6EID8_POSITION                         0x0
#define _RXF6EIDH_RXF6EID8_SIZE                             0x1
#define _RXF6EIDH_RXF6EID8_LENGTH                           0x1
#define _RXF6EIDH_RXF6EID8_MASK                             0x1
#define _RXF6EIDH_RXF6EID9_POSN                             0x1
#define _RXF6EIDH_RXF6EID9_POSITION                         0x1
#define _RXF6EIDH_RXF6EID9_SIZE                             0x1
#define _RXF6EIDH_RXF6EID9_LENGTH                           0x1
#define _RXF6EIDH_RXF6EID9_MASK                             0x2
#define _RXF6EIDH_RXF6EID10_POSN                            0x2
#define _RXF6EIDH_RXF6EID10_POSITION                        0x2
#define _RXF6EIDH_RXF6EID10_SIZE                            0x1
#define _RXF6EIDH_RXF6EID10_LENGTH                          0x1
#define _RXF6EIDH_RXF6EID10_MASK                            0x4
#define _RXF6EIDH_RXF6EID11_POSN                            0x3
#define _RXF6EIDH_RXF6EID11_POSITION                        0x3
#define _RXF6EIDH_RXF6EID11_SIZE                            0x1
#define _RXF6EIDH_RXF6EID11_LENGTH                          0x1
#define _RXF6EIDH_RXF6EID11_MASK                            0x8
#define _RXF6EIDH_RXF6EID12_POSN                            0x4
#define _RXF6EIDH_RXF6EID12_POSITION                        0x4
#define _RXF6EIDH_RXF6EID12_SIZE                            0x1
#define _RXF6EIDH_RXF6EID12_LENGTH                          0x1
#define _RXF6EIDH_RXF6EID12_MASK                            0x10
#define _RXF6EIDH_RXF6EID13_POSN                            0x5
#define _RXF6EIDH_RXF6EID13_POSITION                        0x5
#define _RXF6EIDH_RXF6EID13_SIZE                            0x1
#define _RXF6EIDH_RXF6EID13_LENGTH                          0x1
#define _RXF6EIDH_RXF6EID13_MASK                            0x20
#define _RXF6EIDH_RXF6EID14_POSN                            0x6
#define _RXF6EIDH_RXF6EID14_POSITION                        0x6
#define _RXF6EIDH_RXF6EID14_SIZE                            0x1
#define _RXF6EIDH_RXF6EID14_LENGTH                          0x1
#define _RXF6EIDH_RXF6EID14_MASK                            0x40
#define _RXF6EIDH_RXF6EID15_POSN                            0x7
#define _RXF6EIDH_RXF6EID15_POSITION                        0x7
#define _RXF6EIDH_RXF6EID15_SIZE                            0x1
#define _RXF6EIDH_RXF6EID15_LENGTH                          0x1
#define _RXF6EIDH_RXF6EID15_MASK                            0x80

// Register: RXF6EIDL
#define RXF6EIDL RXF6EIDL
extern volatile unsigned char           RXF6EIDL            __at(0xD63);
#ifndef _LIB_BUILD
asm("RXF6EIDL equ 0D63h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXF6EID0               :1;
        unsigned RXF6EID1               :1;
        unsigned RXF6EID2               :1;
        unsigned RXF6EID3               :1;
        unsigned RXF6EID4               :1;
        unsigned RXF6EID5               :1;
        unsigned RXF6EID6               :1;
        unsigned RXF6EID7               :1;
    };
} RXF6EIDLbits_t;
extern volatile RXF6EIDLbits_t RXF6EIDLbits __at(0xD63);
// bitfield macros
#define _RXF6EIDL_EID0_POSN                                 0x0
#define _RXF6EIDL_EID0_POSITION                             0x0
#define _RXF6EIDL_EID0_SIZE                                 0x1
#define _RXF6EIDL_EID0_LENGTH                               0x1
#define _RXF6EIDL_EID0_MASK                                 0x1
#define _RXF6EIDL_EID1_POSN                                 0x1
#define _RXF6EIDL_EID1_POSITION                             0x1
#define _RXF6EIDL_EID1_SIZE                                 0x1
#define _RXF6EIDL_EID1_LENGTH                               0x1
#define _RXF6EIDL_EID1_MASK                                 0x2
#define _RXF6EIDL_EID2_POSN                                 0x2
#define _RXF6EIDL_EID2_POSITION                             0x2
#define _RXF6EIDL_EID2_SIZE                                 0x1
#define _RXF6EIDL_EID2_LENGTH                               0x1
#define _RXF6EIDL_EID2_MASK                                 0x4
#define _RXF6EIDL_EID3_POSN                                 0x3
#define _RXF6EIDL_EID3_POSITION                             0x3
#define _RXF6EIDL_EID3_SIZE                                 0x1
#define _RXF6EIDL_EID3_LENGTH                               0x1
#define _RXF6EIDL_EID3_MASK                                 0x8
#define _RXF6EIDL_EID4_POSN                                 0x4
#define _RXF6EIDL_EID4_POSITION                             0x4
#define _RXF6EIDL_EID4_SIZE                                 0x1
#define _RXF6EIDL_EID4_LENGTH                               0x1
#define _RXF6EIDL_EID4_MASK                                 0x10
#define _RXF6EIDL_EID5_POSN                                 0x5
#define _RXF6EIDL_EID5_POSITION                             0x5
#define _RXF6EIDL_EID5_SIZE                                 0x1
#define _RXF6EIDL_EID5_LENGTH                               0x1
#define _RXF6EIDL_EID5_MASK                                 0x20
#define _RXF6EIDL_EID6_POSN                                 0x6
#define _RXF6EIDL_EID6_POSITION                             0x6
#define _RXF6EIDL_EID6_SIZE                                 0x1
#define _RXF6EIDL_EID6_LENGTH                               0x1
#define _RXF6EIDL_EID6_MASK                                 0x40
#define _RXF6EIDL_EID7_POSN                                 0x7
#define _RXF6EIDL_EID7_POSITION                             0x7
#define _RXF6EIDL_EID7_SIZE                                 0x1
#define _RXF6EIDL_EID7_LENGTH                               0x1
#define _RXF6EIDL_EID7_MASK                                 0x80
#define _RXF6EIDL_RXF6EID0_POSN                             0x0
#define _RXF6EIDL_RXF6EID0_POSITION                         0x0
#define _RXF6EIDL_RXF6EID0_SIZE                             0x1
#define _RXF6EIDL_RXF6EID0_LENGTH                           0x1
#define _RXF6EIDL_RXF6EID0_MASK                             0x1
#define _RXF6EIDL_RXF6EID1_POSN                             0x1
#define _RXF6EIDL_RXF6EID1_POSITION                         0x1
#define _RXF6EIDL_RXF6EID1_SIZE                             0x1
#define _RXF6EIDL_RXF6EID1_LENGTH                           0x1
#define _RXF6EIDL_RXF6EID1_MASK                             0x2
#define _RXF6EIDL_RXF6EID2_POSN                             0x2
#define _RXF6EIDL_RXF6EID2_POSITION                         0x2
#define _RXF6EIDL_RXF6EID2_SIZE                             0x1
#define _RXF6EIDL_RXF6EID2_LENGTH                           0x1
#define _RXF6EIDL_RXF6EID2_MASK                             0x4
#define _RXF6EIDL_RXF6EID3_POSN                             0x3
#define _RXF6EIDL_RXF6EID3_POSITION                         0x3
#define _RXF6EIDL_RXF6EID3_SIZE                             0x1
#define _RXF6EIDL_RXF6EID3_LENGTH                           0x1
#define _RXF6EIDL_RXF6EID3_MASK                             0x8
#define _RXF6EIDL_RXF6EID4_POSN                             0x4
#define _RXF6EIDL_RXF6EID4_POSITION                         0x4
#define _RXF6EIDL_RXF6EID4_SIZE                             0x1
#define _RXF6EIDL_RXF6EID4_LENGTH                           0x1
#define _RXF6EIDL_RXF6EID4_MASK                             0x10
#define _RXF6EIDL_RXF6EID5_POSN                             0x5
#define _RXF6EIDL_RXF6EID5_POSITION                         0x5
#define _RXF6EIDL_RXF6EID5_SIZE                             0x1
#define _RXF6EIDL_RXF6EID5_LENGTH                           0x1
#define _RXF6EIDL_RXF6EID5_MASK                             0x20
#define _RXF6EIDL_RXF6EID6_POSN                             0x6
#define _RXF6EIDL_RXF6EID6_POSITION                         0x6
#define _RXF6EIDL_RXF6EID6_SIZE                             0x1
#define _RXF6EIDL_RXF6EID6_LENGTH                           0x1
#define _RXF6EIDL_RXF6EID6_MASK                             0x40
#define _RXF6EIDL_RXF6EID7_POSN                             0x7
#define _RXF6EIDL_RXF6EID7_POSITION                         0x7
#define _RXF6EIDL_RXF6EID7_SIZE                             0x1
#define _RXF6EIDL_RXF6EID7_LENGTH                           0x1
#define _RXF6EIDL_RXF6EID7_MASK                             0x80

