MikroElektronika/core_packages/PIC/XC8/def/PIC18F2682/mcu.h
// Register: RXFBCON1
#define RXFBCON1 RXFBCON1
extern volatile unsigned char           RXFBCON1            __at(0xDE1);
#ifndef _LIB_BUILD
asm("RXFBCON1 equ 0DE1h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned F2BP_0                 :1;
        unsigned F2BP_1                 :1;
        unsigned F2BP_2                 :1;
        unsigned F2BP_3                 :1;
        unsigned F3BP_0                 :1;
        unsigned F3BP_1                 :1;
        unsigned F3BP_2                 :1;
        unsigned F3BP_3                 :1;
    };
    struct {
        unsigned F2BP_01                :1;
    };
} RXFBCON1bits_t;
extern volatile RXFBCON1bits_t RXFBCON1bits __at(0xDE1);
// bitfield macros
#define _RXFBCON1_F2BP_0_POSN                               0x0
#define _RXFBCON1_F2BP_0_POSITION                           0x0
#define _RXFBCON1_F2BP_0_SIZE                               0x1
#define _RXFBCON1_F2BP_0_LENGTH                             0x1
#define _RXFBCON1_F2BP_0_MASK                               0x1
#define _RXFBCON1_F2BP_1_POSN                               0x1
#define _RXFBCON1_F2BP_1_POSITION                           0x1
#define _RXFBCON1_F2BP_1_SIZE                               0x1
#define _RXFBCON1_F2BP_1_LENGTH                             0x1
#define _RXFBCON1_F2BP_1_MASK                               0x2
#define _RXFBCON1_F2BP_2_POSN                               0x2
#define _RXFBCON1_F2BP_2_POSITION                           0x2
#define _RXFBCON1_F2BP_2_SIZE                               0x1
#define _RXFBCON1_F2BP_2_LENGTH                             0x1
#define _RXFBCON1_F2BP_2_MASK                               0x4
#define _RXFBCON1_F2BP_3_POSN                               0x3
#define _RXFBCON1_F2BP_3_POSITION                           0x3
#define _RXFBCON1_F2BP_3_SIZE                               0x1
#define _RXFBCON1_F2BP_3_LENGTH                             0x1
#define _RXFBCON1_F2BP_3_MASK                               0x8
#define _RXFBCON1_F3BP_0_POSN                               0x4
#define _RXFBCON1_F3BP_0_POSITION                           0x4
#define _RXFBCON1_F3BP_0_SIZE                               0x1
#define _RXFBCON1_F3BP_0_LENGTH                             0x1
#define _RXFBCON1_F3BP_0_MASK                               0x10
#define _RXFBCON1_F3BP_1_POSN                               0x5
#define _RXFBCON1_F3BP_1_POSITION                           0x5
#define _RXFBCON1_F3BP_1_SIZE                               0x1
#define _RXFBCON1_F3BP_1_LENGTH                             0x1
#define _RXFBCON1_F3BP_1_MASK                               0x20
#define _RXFBCON1_F3BP_2_POSN                               0x6
#define _RXFBCON1_F3BP_2_POSITION                           0x6
#define _RXFBCON1_F3BP_2_SIZE                               0x1
#define _RXFBCON1_F3BP_2_LENGTH                             0x1
#define _RXFBCON1_F3BP_2_MASK                               0x40
#define _RXFBCON1_F3BP_3_POSN                               0x7
#define _RXFBCON1_F3BP_3_POSITION                           0x7
#define _RXFBCON1_F3BP_3_SIZE                               0x1
#define _RXFBCON1_F3BP_3_LENGTH                             0x1
#define _RXFBCON1_F3BP_3_MASK                               0x80
#define _RXFBCON1_F2BP_01_POSN                              0x0
#define _RXFBCON1_F2BP_01_POSITION                          0x0
#define _RXFBCON1_F2BP_01_SIZE                              0x1
#define _RXFBCON1_F2BP_01_LENGTH                            0x1
#define _RXFBCON1_F2BP_01_MASK                              0x1

// Register: RXFBCON2
#define RXFBCON2 RXFBCON2
extern volatile unsigned char           RXFBCON2            __at(0xDE2);
#ifndef _LIB_BUILD
asm("RXFBCON2 equ 0DE2h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned F4BP_0                 :1;
        unsigned F4BP_1                 :1;
        unsigned F4BP_2                 :1;
        unsigned F4BP_3                 :1;
        unsigned F5BP_0                 :1;
        unsigned F5BP_1                 :1;
        unsigned F5BP_2                 :1;
        unsigned F5BP_3                 :1;
    };
    struct {
        unsigned F4BP_01                :1;
    };
} RXFBCON2bits_t;
extern volatile RXFBCON2bits_t RXFBCON2bits __at(0xDE2);
// bitfield macros
#define _RXFBCON2_F4BP_0_POSN                               0x0
#define _RXFBCON2_F4BP_0_POSITION                           0x0
#define _RXFBCON2_F4BP_0_SIZE                               0x1
#define _RXFBCON2_F4BP_0_LENGTH                             0x1
#define _RXFBCON2_F4BP_0_MASK                               0x1
#define _RXFBCON2_F4BP_1_POSN                               0x1
#define _RXFBCON2_F4BP_1_POSITION                           0x1
#define _RXFBCON2_F4BP_1_SIZE                               0x1
#define _RXFBCON2_F4BP_1_LENGTH                             0x1
#define _RXFBCON2_F4BP_1_MASK                               0x2
#define _RXFBCON2_F4BP_2_POSN                               0x2
#define _RXFBCON2_F4BP_2_POSITION                           0x2
#define _RXFBCON2_F4BP_2_SIZE                               0x1
#define _RXFBCON2_F4BP_2_LENGTH                             0x1
#define _RXFBCON2_F4BP_2_MASK                               0x4
#define _RXFBCON2_F4BP_3_POSN                               0x3
#define _RXFBCON2_F4BP_3_POSITION                           0x3
#define _RXFBCON2_F4BP_3_SIZE                               0x1
#define _RXFBCON2_F4BP_3_LENGTH                             0x1
#define _RXFBCON2_F4BP_3_MASK                               0x8
#define _RXFBCON2_F5BP_0_POSN                               0x4
#define _RXFBCON2_F5BP_0_POSITION                           0x4
#define _RXFBCON2_F5BP_0_SIZE                               0x1
#define _RXFBCON2_F5BP_0_LENGTH                             0x1
#define _RXFBCON2_F5BP_0_MASK                               0x10
#define _RXFBCON2_F5BP_1_POSN                               0x5
#define _RXFBCON2_F5BP_1_POSITION                           0x5
#define _RXFBCON2_F5BP_1_SIZE                               0x1
#define _RXFBCON2_F5BP_1_LENGTH                             0x1
#define _RXFBCON2_F5BP_1_MASK                               0x20
#define _RXFBCON2_F5BP_2_POSN                               0x6
#define _RXFBCON2_F5BP_2_POSITION                           0x6
#define _RXFBCON2_F5BP_2_SIZE                               0x1
#define _RXFBCON2_F5BP_2_LENGTH                             0x1
#define _RXFBCON2_F5BP_2_MASK                               0x40
#define _RXFBCON2_F5BP_3_POSN                               0x7
#define _RXFBCON2_F5BP_3_POSITION                           0x7
#define _RXFBCON2_F5BP_3_SIZE                               0x1
#define _RXFBCON2_F5BP_3_LENGTH                             0x1
#define _RXFBCON2_F5BP_3_MASK                               0x80
#define _RXFBCON2_F4BP_01_POSN                              0x0
#define _RXFBCON2_F4BP_01_POSITION                          0x0
#define _RXFBCON2_F4BP_01_SIZE                              0x1
#define _RXFBCON2_F4BP_01_LENGTH                            0x1
#define _RXFBCON2_F4BP_01_MASK                              0x1

