MikroElektronika/core_packages/PIC/XC8/def/PIC18F2682/mcu.h
extern volatile B2DLCbits_t B2DLCbits __at(0xE45);
// bitfield macros
#define _B2DLC_DLC0_POSN                                    0x0
#define _B2DLC_DLC0_POSITION                                0x0
#define _B2DLC_DLC0_SIZE                                    0x1
#define _B2DLC_DLC0_LENGTH                                  0x1
#define _B2DLC_DLC0_MASK                                    0x1
#define _B2DLC_DLC1_POSN                                    0x1
#define _B2DLC_DLC1_POSITION                                0x1
#define _B2DLC_DLC1_SIZE                                    0x1
#define _B2DLC_DLC1_LENGTH                                  0x1
#define _B2DLC_DLC1_MASK                                    0x2
#define _B2DLC_DLC2_POSN                                    0x2
#define _B2DLC_DLC2_POSITION                                0x2
#define _B2DLC_DLC2_SIZE                                    0x1
#define _B2DLC_DLC2_LENGTH                                  0x1
#define _B2DLC_DLC2_MASK                                    0x4
#define _B2DLC_DLC3_POSN                                    0x3
#define _B2DLC_DLC3_POSITION                                0x3
#define _B2DLC_DLC3_SIZE                                    0x1
#define _B2DLC_DLC3_LENGTH                                  0x1
#define _B2DLC_DLC3_MASK                                    0x8
#define _B2DLC_RB0_POSN                                     0x4
#define _B2DLC_RB0_POSITION                                 0x4
#define _B2DLC_RB0_SIZE                                     0x1
#define _B2DLC_RB0_LENGTH                                   0x1
#define _B2DLC_RB0_MASK                                     0x10
#define _B2DLC_RB1_POSN                                     0x5
#define _B2DLC_RB1_POSITION                                 0x5
#define _B2DLC_RB1_SIZE                                     0x1
#define _B2DLC_RB1_LENGTH                                   0x1
#define _B2DLC_RB1_MASK                                     0x20
#define _B2DLC_RXRTR_TXRTR_POSN                             0x6
#define _B2DLC_RXRTR_TXRTR_POSITION                         0x6
#define _B2DLC_RXRTR_TXRTR_SIZE                             0x1
#define _B2DLC_RXRTR_TXRTR_LENGTH                           0x1
#define _B2DLC_RXRTR_TXRTR_MASK                             0x40
#define _B2DLC_RESRB0_POSN                                  0x4
#define _B2DLC_RESRB0_POSITION                              0x4
#define _B2DLC_RESRB0_SIZE                                  0x1
#define _B2DLC_RESRB0_LENGTH                                0x1
#define _B2DLC_RESRB0_MASK                                  0x10
#define _B2DLC_RESRB1_POSN                                  0x5
#define _B2DLC_RESRB1_POSITION                              0x5
#define _B2DLC_RESRB1_SIZE                                  0x1
#define _B2DLC_RESRB1_LENGTH                                0x1
#define _B2DLC_RESRB1_MASK                                  0x20
#define _B2DLC_TXRTR_POSN                                   0x6
#define _B2DLC_TXRTR_POSITION                               0x6
#define _B2DLC_TXRTR_SIZE                                   0x1
#define _B2DLC_TXRTR_LENGTH                                 0x1
#define _B2DLC_TXRTR_MASK                                   0x40
#define _B2DLC_RXRTR_POSN                                   0x6
#define _B2DLC_RXRTR_POSITION                               0x6
#define _B2DLC_RXRTR_SIZE                                   0x1
#define _B2DLC_RXRTR_LENGTH                                 0x1
#define _B2DLC_RXRTR_MASK                                   0x40
#define _B2DLC_B2DLC0_POSN                                  0x0
#define _B2DLC_B2DLC0_POSITION                              0x0
#define _B2DLC_B2DLC0_SIZE                                  0x1
#define _B2DLC_B2DLC0_LENGTH                                0x1
#define _B2DLC_B2DLC0_MASK                                  0x1
#define _B2DLC_B2DLC1_POSN                                  0x1
#define _B2DLC_B2DLC1_POSITION                              0x1
#define _B2DLC_B2DLC1_SIZE                                  0x1
#define _B2DLC_B2DLC1_LENGTH                                0x1
#define _B2DLC_B2DLC1_MASK                                  0x2
#define _B2DLC_B2DLC2_POSN                                  0x2
#define _B2DLC_B2DLC2_POSITION                              0x2
#define _B2DLC_B2DLC2_SIZE                                  0x1
#define _B2DLC_B2DLC2_LENGTH                                0x1
#define _B2DLC_B2DLC2_MASK                                  0x4
#define _B2DLC_B2DLC3_POSN                                  0x3
#define _B2DLC_B2DLC3_POSITION                              0x3
#define _B2DLC_B2DLC3_SIZE                                  0x1
#define _B2DLC_B2DLC3_LENGTH                                0x1
#define _B2DLC_B2DLC3_MASK                                  0x8
#define _B2DLC_B2RB0_POSN                                   0x4
#define _B2DLC_B2RB0_POSITION                               0x4
#define _B2DLC_B2RB0_SIZE                                   0x1
#define _B2DLC_B2RB0_LENGTH                                 0x1
#define _B2DLC_B2RB0_MASK                                   0x10
#define _B2DLC_B2RB1_POSN                                   0x5
#define _B2DLC_B2RB1_POSITION                               0x5
#define _B2DLC_B2RB1_SIZE                                   0x1
#define _B2DLC_B2RB1_LENGTH                                 0x1
#define _B2DLC_B2RB1_MASK                                   0x20
#define _B2DLC_B2RXRTR_POSN                                 0x6
#define _B2DLC_B2RXRTR_POSITION                             0x6
#define _B2DLC_B2RXRTR_SIZE                                 0x1
#define _B2DLC_B2RXRTR_LENGTH                               0x1
#define _B2DLC_B2RXRTR_MASK                                 0x40

// Register: B2D0
#define B2D0 B2D0
extern volatile unsigned char           B2D0                __at(0xE46);
#ifndef _LIB_BUILD
asm("B2D0 equ 0E46h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B2D00                  :1;
        unsigned B2D01                  :1;
        unsigned B2D02                  :1;
        unsigned B2D03                  :1;
        unsigned B2D04                  :1;
        unsigned B2D05                  :1;
        unsigned B2D06                  :1;
        unsigned B2D07                  :1;
    };
} B2D0bits_t;
extern volatile B2D0bits_t B2D0bits __at(0xE46);
// bitfield macros
#define _B2D0_B2D00_POSN                                    0x0
#define _B2D0_B2D00_POSITION                                0x0
#define _B2D0_B2D00_SIZE                                    0x1
#define _B2D0_B2D00_LENGTH                                  0x1
#define _B2D0_B2D00_MASK                                    0x1
#define _B2D0_B2D01_POSN                                    0x1
#define _B2D0_B2D01_POSITION                                0x1
#define _B2D0_B2D01_SIZE                                    0x1
#define _B2D0_B2D01_LENGTH                                  0x1
#define _B2D0_B2D01_MASK                                    0x2
#define _B2D0_B2D02_POSN                                    0x2
#define _B2D0_B2D02_POSITION                                0x2
#define _B2D0_B2D02_SIZE                                    0x1
#define _B2D0_B2D02_LENGTH                                  0x1
#define _B2D0_B2D02_MASK                                    0x4
#define _B2D0_B2D03_POSN                                    0x3
#define _B2D0_B2D03_POSITION                                0x3
#define _B2D0_B2D03_SIZE                                    0x1
#define _B2D0_B2D03_LENGTH                                  0x1
#define _B2D0_B2D03_MASK                                    0x8
#define _B2D0_B2D04_POSN                                    0x4
#define _B2D0_B2D04_POSITION                                0x4
#define _B2D0_B2D04_SIZE                                    0x1
#define _B2D0_B2D04_LENGTH                                  0x1
#define _B2D0_B2D04_MASK                                    0x10
#define _B2D0_B2D05_POSN                                    0x5
#define _B2D0_B2D05_POSITION                                0x5
#define _B2D0_B2D05_SIZE                                    0x1
#define _B2D0_B2D05_LENGTH                                  0x1
#define _B2D0_B2D05_MASK                                    0x20
#define _B2D0_B2D06_POSN                                    0x6
#define _B2D0_B2D06_POSITION                                0x6
#define _B2D0_B2D06_SIZE                                    0x1
#define _B2D0_B2D06_LENGTH                                  0x1
#define _B2D0_B2D06_MASK                                    0x40
#define _B2D0_B2D07_POSN                                    0x7
#define _B2D0_B2D07_POSITION                                0x7
#define _B2D0_B2D07_SIZE                                    0x1
#define _B2D0_B2D07_LENGTH                                  0x1
#define _B2D0_B2D07_MASK                                    0x80

// Register: B2D1
#define B2D1 B2D1
extern volatile unsigned char           B2D1                __at(0xE47);
#ifndef _LIB_BUILD
asm("B2D1 equ 0E47h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B2D10                  :1;
        unsigned B2D11                  :1;
        unsigned B2D12                  :1;
        unsigned B2D13                  :1;
        unsigned B2D14                  :1;
        unsigned B2D15                  :1;
        unsigned B2D16                  :1;
        unsigned B2D17                  :1;
    };
} B2D1bits_t;
extern volatile B2D1bits_t B2D1bits __at(0xE47);
// bitfield macros
#define _B2D1_B2D10_POSN                                    0x0
#define _B2D1_B2D10_POSITION                                0x0
#define _B2D1_B2D10_SIZE                                    0x1
#define _B2D1_B2D10_LENGTH                                  0x1
#define _B2D1_B2D10_MASK                                    0x1
#define _B2D1_B2D11_POSN                                    0x1
#define _B2D1_B2D11_POSITION                                0x1
#define _B2D1_B2D11_SIZE                                    0x1
#define _B2D1_B2D11_LENGTH                                  0x1
#define _B2D1_B2D11_MASK                                    0x2
#define _B2D1_B2D12_POSN                                    0x2
#define _B2D1_B2D12_POSITION                                0x2
#define _B2D1_B2D12_SIZE                                    0x1
#define _B2D1_B2D12_LENGTH                                  0x1
#define _B2D1_B2D12_MASK                                    0x4
#define _B2D1_B2D13_POSN                                    0x3
#define _B2D1_B2D13_POSITION                                0x3
#define _B2D1_B2D13_SIZE                                    0x1
#define _B2D1_B2D13_LENGTH                                  0x1
#define _B2D1_B2D13_MASK                                    0x8
#define _B2D1_B2D14_POSN                                    0x4
#define _B2D1_B2D14_POSITION                                0x4
#define _B2D1_B2D14_SIZE                                    0x1
#define _B2D1_B2D14_LENGTH                                  0x1
#define _B2D1_B2D14_MASK                                    0x10
#define _B2D1_B2D15_POSN                                    0x5
#define _B2D1_B2D15_POSITION                                0x5
#define _B2D1_B2D15_SIZE                                    0x1
#define _B2D1_B2D15_LENGTH                                  0x1
#define _B2D1_B2D15_MASK                                    0x20
#define _B2D1_B2D16_POSN                                    0x6
#define _B2D1_B2D16_POSITION                                0x6
#define _B2D1_B2D16_SIZE                                    0x1
#define _B2D1_B2D16_LENGTH                                  0x1
#define _B2D1_B2D16_MASK                                    0x40
#define _B2D1_B2D17_POSN                                    0x7
#define _B2D1_B2D17_POSITION                                0x7
#define _B2D1_B2D17_SIZE                                    0x1
#define _B2D1_B2D17_LENGTH                                  0x1
#define _B2D1_B2D17_MASK                                    0x80

// Register: B2D2
#define B2D2 B2D2
extern volatile unsigned char           B2D2                __at(0xE48);
#ifndef _LIB_BUILD
asm("B2D2 equ 0E48h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B2D20                  :1;
        unsigned B2D21                  :1;
        unsigned B2D22                  :1;
        unsigned B2D23                  :1;
        unsigned B2D24                  :1;
        unsigned B2D25                  :1;
        unsigned B2D26                  :1;
        unsigned B2D27                  :1;
    };
} B2D2bits_t;
extern volatile B2D2bits_t B2D2bits __at(0xE48);
// bitfield macros
#define _B2D2_B2D20_POSN                                    0x0
#define _B2D2_B2D20_POSITION                                0x0
#define _B2D2_B2D20_SIZE                                    0x1
#define _B2D2_B2D20_LENGTH                                  0x1
#define _B2D2_B2D20_MASK                                    0x1
#define _B2D2_B2D21_POSN                                    0x1
#define _B2D2_B2D21_POSITION                                0x1
#define _B2D2_B2D21_SIZE                                    0x1
#define _B2D2_B2D21_LENGTH                                  0x1
#define _B2D2_B2D21_MASK                                    0x2
#define _B2D2_B2D22_POSN                                    0x2
#define _B2D2_B2D22_POSITION                                0x2
#define _B2D2_B2D22_SIZE                                    0x1
#define _B2D2_B2D22_LENGTH                                  0x1
#define _B2D2_B2D22_MASK                                    0x4
#define _B2D2_B2D23_POSN                                    0x3
#define _B2D2_B2D23_POSITION                                0x3
#define _B2D2_B2D23_SIZE                                    0x1
#define _B2D2_B2D23_LENGTH                                  0x1
#define _B2D2_B2D23_MASK                                    0x8
#define _B2D2_B2D24_POSN                                    0x4
#define _B2D2_B2D24_POSITION                                0x4
#define _B2D2_B2D24_SIZE                                    0x1
#define _B2D2_B2D24_LENGTH                                  0x1
#define _B2D2_B2D24_MASK                                    0x10
#define _B2D2_B2D25_POSN                                    0x5
#define _B2D2_B2D25_POSITION                                0x5
#define _B2D2_B2D25_SIZE                                    0x1
#define _B2D2_B2D25_LENGTH                                  0x1
#define _B2D2_B2D25_MASK                                    0x20
#define _B2D2_B2D26_POSN                                    0x6
#define _B2D2_B2D26_POSITION                                0x6
#define _B2D2_B2D26_SIZE                                    0x1
#define _B2D2_B2D26_LENGTH                                  0x1
#define _B2D2_B2D26_MASK                                    0x40
#define _B2D2_B2D27_POSN                                    0x7
#define _B2D2_B2D27_POSITION                                0x7
#define _B2D2_B2D27_SIZE                                    0x1
#define _B2D2_B2D27_LENGTH                                  0x1
#define _B2D2_B2D27_MASK                                    0x80

// Register: B2D3
#define B2D3 B2D3
extern volatile unsigned char           B2D3                __at(0xE49);
#ifndef _LIB_BUILD
asm("B2D3 equ 0E49h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned B2D30                  :1;
        unsigned B2D31                  :1;
        unsigned B2D32                  :1;
        unsigned B2D33                  :1;
        unsigned B2D34                  :1;
        unsigned B2D35                  :1;
        unsigned B2D36                  :1;
        unsigned B2D37                  :1;
    };
} B2D3bits_t;
