MikroElektronika/core_packages/PIC/XC8/def/PIC18F2682/mcu.h
extern volatile B3CONbits_t B3CONbits __at(0xE50);
// bitfield macros
#define _B3CON_FILHIT0_TXPRI0_POSN                          0x0
#define _B3CON_FILHIT0_TXPRI0_POSITION                      0x0
#define _B3CON_FILHIT0_TXPRI0_SIZE                          0x1
#define _B3CON_FILHIT0_TXPRI0_LENGTH                        0x1
#define _B3CON_FILHIT0_TXPRI0_MASK                          0x1
#define _B3CON_FILHIT1_TXPRI1_POSN                          0x1
#define _B3CON_FILHIT1_TXPRI1_POSITION                      0x1
#define _B3CON_FILHIT1_TXPRI1_SIZE                          0x1
#define _B3CON_FILHIT1_TXPRI1_LENGTH                        0x1
#define _B3CON_FILHIT1_TXPRI1_MASK                          0x2
#define _B3CON_FILHIT2_RTREN_POSN                           0x2
#define _B3CON_FILHIT2_RTREN_POSITION                       0x2
#define _B3CON_FILHIT2_RTREN_SIZE                           0x1
#define _B3CON_FILHIT2_RTREN_LENGTH                         0x1
#define _B3CON_FILHIT2_RTREN_MASK                           0x4
#define _B3CON_FILHIT3_TXREQ_POSN                           0x3
#define _B3CON_FILHIT3_TXREQ_POSITION                       0x3
#define _B3CON_FILHIT3_TXREQ_SIZE                           0x1
#define _B3CON_FILHIT3_TXREQ_LENGTH                         0x1
#define _B3CON_FILHIT3_TXREQ_MASK                           0x8
#define _B3CON_FILHIT4_TXERR_POSN                           0x4
#define _B3CON_FILHIT4_TXERR_POSITION                       0x4
#define _B3CON_FILHIT4_TXERR_SIZE                           0x1
#define _B3CON_FILHIT4_TXERR_LENGTH                         0x1
#define _B3CON_FILHIT4_TXERR_MASK                           0x10
#define _B3CON_RXRTRRO_TXLARB_POSN                          0x5
#define _B3CON_RXRTRRO_TXLARB_POSITION                      0x5
#define _B3CON_RXRTRRO_TXLARB_SIZE                          0x1
#define _B3CON_RXRTRRO_TXLARB_LENGTH                        0x1
#define _B3CON_RXRTRRO_TXLARB_MASK                          0x20
#define _B3CON_RXM1_TXABT_POSN                              0x6
#define _B3CON_RXM1_TXABT_POSITION                          0x6
#define _B3CON_RXM1_TXABT_SIZE                              0x1
#define _B3CON_RXM1_TXABT_LENGTH                            0x1
#define _B3CON_RXM1_TXABT_MASK                              0x40
#define _B3CON_RXFUL_TXBIF_POSN                             0x7
#define _B3CON_RXFUL_TXBIF_POSITION                         0x7
#define _B3CON_RXFUL_TXBIF_SIZE                             0x1
#define _B3CON_RXFUL_TXBIF_LENGTH                           0x1
#define _B3CON_RXFUL_TXBIF_MASK                             0x80
#define _B3CON_FILHIT0_POSN                                 0x0
#define _B3CON_FILHIT0_POSITION                             0x0
#define _B3CON_FILHIT0_SIZE                                 0x1
#define _B3CON_FILHIT0_LENGTH                               0x1
#define _B3CON_FILHIT0_MASK                                 0x1
#define _B3CON_FILHIT1_POSN                                 0x1
#define _B3CON_FILHIT1_POSITION                             0x1
#define _B3CON_FILHIT1_SIZE                                 0x1
#define _B3CON_FILHIT1_LENGTH                               0x1
#define _B3CON_FILHIT1_MASK                                 0x2
#define _B3CON_FILHIT2_POSN                                 0x2
#define _B3CON_FILHIT2_POSITION                             0x2
#define _B3CON_FILHIT2_SIZE                                 0x1
#define _B3CON_FILHIT2_LENGTH                               0x1
#define _B3CON_FILHIT2_MASK                                 0x4
#define _B3CON_FILHIT3_POSN                                 0x3
#define _B3CON_FILHIT3_POSITION                             0x3
#define _B3CON_FILHIT3_SIZE                                 0x1
#define _B3CON_FILHIT3_LENGTH                               0x1
#define _B3CON_FILHIT3_MASK                                 0x8
#define _B3CON_FILHIT4_POSN                                 0x4
#define _B3CON_FILHIT4_POSITION                             0x4
#define _B3CON_FILHIT4_SIZE                                 0x1
#define _B3CON_FILHIT4_LENGTH                               0x1
#define _B3CON_FILHIT4_MASK                                 0x10
#define _B3CON_RTRRO_POSN                                   0x5
#define _B3CON_RTRRO_POSITION                               0x5
#define _B3CON_RTRRO_SIZE                                   0x1
#define _B3CON_RTRRO_LENGTH                                 0x1
#define _B3CON_RTRRO_MASK                                   0x20
#define _B3CON_RXM1_POSN                                    0x6
#define _B3CON_RXM1_POSITION                                0x6
#define _B3CON_RXM1_SIZE                                    0x1
#define _B3CON_RXM1_LENGTH                                  0x1
#define _B3CON_RXM1_MASK                                    0x40
#define _B3CON_RXFUL_POSN                                   0x7
#define _B3CON_RXFUL_POSITION                               0x7
#define _B3CON_RXFUL_SIZE                                   0x1
#define _B3CON_RXFUL_LENGTH                                 0x1
#define _B3CON_RXFUL_MASK                                   0x80
#define _B3CON_TXPRI0_POSN                                  0x0
#define _B3CON_TXPRI0_POSITION                              0x0
#define _B3CON_TXPRI0_SIZE                                  0x1
#define _B3CON_TXPRI0_LENGTH                                0x1
#define _B3CON_TXPRI0_MASK                                  0x1
#define _B3CON_TXPRI1_POSN                                  0x1
#define _B3CON_TXPRI1_POSITION                              0x1
#define _B3CON_TXPRI1_SIZE                                  0x1
#define _B3CON_TXPRI1_LENGTH                                0x1
#define _B3CON_TXPRI1_MASK                                  0x2
#define _B3CON_RTREN_POSN                                   0x2
#define _B3CON_RTREN_POSITION                               0x2
#define _B3CON_RTREN_SIZE                                   0x1
#define _B3CON_RTREN_LENGTH                                 0x1
#define _B3CON_RTREN_MASK                                   0x4
#define _B3CON_TXREQ_POSN                                   0x3
#define _B3CON_TXREQ_POSITION                               0x3
#define _B3CON_TXREQ_SIZE                                   0x1
#define _B3CON_TXREQ_LENGTH                                 0x1
#define _B3CON_TXREQ_MASK                                   0x8
#define _B3CON_TXERR_POSN                                   0x4
#define _B3CON_TXERR_POSITION                               0x4
#define _B3CON_TXERR_SIZE                                   0x1
#define _B3CON_TXERR_LENGTH                                 0x1
#define _B3CON_TXERR_MASK                                   0x10
#define _B3CON_TXLARB_POSN                                  0x5
#define _B3CON_TXLARB_POSITION                              0x5
#define _B3CON_TXLARB_SIZE                                  0x1
#define _B3CON_TXLARB_LENGTH                                0x1
#define _B3CON_TXLARB_MASK                                  0x20
#define _B3CON_TXABT_POSN                                   0x6
#define _B3CON_TXABT_POSITION                               0x6
#define _B3CON_TXABT_SIZE                                   0x1
#define _B3CON_TXABT_LENGTH                                 0x1
#define _B3CON_TXABT_MASK                                   0x40
#define _B3CON_TXBIF_POSN                                   0x7
#define _B3CON_TXBIF_POSITION                               0x7
#define _B3CON_TXBIF_SIZE                                   0x1
#define _B3CON_TXBIF_LENGTH                                 0x1
#define _B3CON_TXBIF_MASK                                   0x80
#define _B3CON_RXRTRRO_POSN                                 0x5
#define _B3CON_RXRTRRO_POSITION                             0x5
#define _B3CON_RXRTRRO_SIZE                                 0x1
#define _B3CON_RXRTRRO_LENGTH                               0x1
#define _B3CON_RXRTRRO_MASK                                 0x20
#define _B3CON_B3FILHIT0_POSN                               0x0
#define _B3CON_B3FILHIT0_POSITION                           0x0
#define _B3CON_B3FILHIT0_SIZE                               0x1
#define _B3CON_B3FILHIT0_LENGTH                             0x1
#define _B3CON_B3FILHIT0_MASK                               0x1
#define _B3CON_B3FILHIT1_POSN                               0x1
#define _B3CON_B3FILHIT1_POSITION                           0x1
#define _B3CON_B3FILHIT1_SIZE                               0x1
#define _B3CON_B3FILHIT1_LENGTH                             0x1
#define _B3CON_B3FILHIT1_MASK                               0x2
#define _B3CON_B3FILHIT2_POSN                               0x2
#define _B3CON_B3FILHIT2_POSITION                           0x2
#define _B3CON_B3FILHIT2_SIZE                               0x1
#define _B3CON_B3FILHIT2_LENGTH                             0x1
#define _B3CON_B3FILHIT2_MASK                               0x4
#define _B3CON_B3FILHIT3_POSN                               0x3
#define _B3CON_B3FILHIT3_POSITION                           0x3
#define _B3CON_B3FILHIT3_SIZE                               0x1
#define _B3CON_B3FILHIT3_LENGTH                             0x1
#define _B3CON_B3FILHIT3_MASK                               0x8
#define _B3CON_B3FILHIT4_POSN                               0x4
#define _B3CON_B3FILHIT4_POSITION                           0x4
#define _B3CON_B3FILHIT4_SIZE                               0x1
#define _B3CON_B3FILHIT4_LENGTH                             0x1
#define _B3CON_B3FILHIT4_MASK                               0x10
#define _B3CON_B3RTRRO_POSN                                 0x5
#define _B3CON_B3RTRRO_POSITION                             0x5
#define _B3CON_B3RTRRO_SIZE                                 0x1
#define _B3CON_B3RTRRO_LENGTH                               0x1
#define _B3CON_B3RTRRO_MASK                                 0x20
#define _B3CON_B3RXM1_POSN                                  0x6
#define _B3CON_B3RXM1_POSITION                              0x6
#define _B3CON_B3RXM1_SIZE                                  0x1
#define _B3CON_B3RXM1_LENGTH                                0x1
#define _B3CON_B3RXM1_MASK                                  0x40
#define _B3CON_B3RXFUL_POSN                                 0x7
#define _B3CON_B3RXFUL_POSITION                             0x7
#define _B3CON_B3RXFUL_SIZE                                 0x1
#define _B3CON_B3RXFUL_LENGTH                               0x1
#define _B3CON_B3RXFUL_MASK                                 0x80
#define _B3CON_B3TXPRI0_POSN                                0x0
#define _B3CON_B3TXPRI0_POSITION                            0x0
#define _B3CON_B3TXPRI0_SIZE                                0x1
#define _B3CON_B3TXPRI0_LENGTH                              0x1
#define _B3CON_B3TXPRI0_MASK                                0x1
#define _B3CON_B3TXPRI1_POSN                                0x1
#define _B3CON_B3TXPRI1_POSITION                            0x1
#define _B3CON_B3TXPRI1_SIZE                                0x1
#define _B3CON_B3TXPRI1_LENGTH                              0x1
#define _B3CON_B3TXPRI1_MASK                                0x2
#define _B3CON_B3RTREN_POSN                                 0x2
#define _B3CON_B3RTREN_POSITION                             0x2
#define _B3CON_B3RTREN_SIZE                                 0x1
#define _B3CON_B3RTREN_LENGTH                               0x1
#define _B3CON_B3RTREN_MASK                                 0x4
#define _B3CON_B3TXREQ_POSN                                 0x3
#define _B3CON_B3TXREQ_POSITION                             0x3
#define _B3CON_B3TXREQ_SIZE                                 0x1
#define _B3CON_B3TXREQ_LENGTH                               0x1
#define _B3CON_B3TXREQ_MASK                                 0x8
#define _B3CON_B3TXERR_POSN                                 0x4
#define _B3CON_B3TXERR_POSITION                             0x4
#define _B3CON_B3TXERR_SIZE                                 0x1
#define _B3CON_B3TXERR_LENGTH                               0x1
#define _B3CON_B3TXERR_MASK                                 0x10
#define _B3CON_B3TXLARB_POSN                                0x5
#define _B3CON_B3TXLARB_POSITION                            0x5
#define _B3CON_B3TXLARB_SIZE                                0x1
#define _B3CON_B3TXLARB_LENGTH                              0x1
#define _B3CON_B3TXLARB_MASK                                0x20
#define _B3CON_B3TXABT_POSN                                 0x6
#define _B3CON_B3TXABT_POSITION                             0x6
#define _B3CON_B3TXABT_SIZE                                 0x1
#define _B3CON_B3TXABT_LENGTH                               0x1
#define _B3CON_B3TXABT_MASK                                 0x40
#define _B3CON_B3TXB3IF_POSN                                0x7
#define _B3CON_B3TXB3IF_POSITION                            0x7
#define _B3CON_B3TXB3IF_SIZE                                0x1
#define _B3CON_B3TXB3IF_LENGTH                              0x1
#define _B3CON_B3TXB3IF_MASK                                0x80

// Register: B3SIDH
#define B3SIDH B3SIDH
extern volatile unsigned char           B3SIDH              __at(0xE51);
#ifndef _LIB_BUILD
asm("B3SIDH equ 0E51h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned B3SID3                 :1;
        unsigned B3SID4                 :1;
        unsigned B3SID5                 :1;
        unsigned B3SID6                 :1;
        unsigned B3SID7                 :1;
        unsigned B3SID8                 :1;
        unsigned B3SID9                 :1;
        unsigned B3SID10                :1;
    };
} B3SIDHbits_t;
extern volatile B3SIDHbits_t B3SIDHbits __at(0xE51);
// bitfield macros
#define _B3SIDH_SID3_POSN                                   0x0
#define _B3SIDH_SID3_POSITION                               0x0
#define _B3SIDH_SID3_SIZE                                   0x1
#define _B3SIDH_SID3_LENGTH                                 0x1
#define _B3SIDH_SID3_MASK                                   0x1
#define _B3SIDH_SID4_POSN                                   0x1
#define _B3SIDH_SID4_POSITION                               0x1
#define _B3SIDH_SID4_SIZE                                   0x1
#define _B3SIDH_SID4_LENGTH                                 0x1
#define _B3SIDH_SID4_MASK                                   0x2
#define _B3SIDH_SID5_POSN                                   0x2
#define _B3SIDH_SID5_POSITION                               0x2
#define _B3SIDH_SID5_SIZE                                   0x1
#define _B3SIDH_SID5_LENGTH                                 0x1
#define _B3SIDH_SID5_MASK                                   0x4
#define _B3SIDH_SID6_POSN                                   0x3
#define _B3SIDH_SID6_POSITION                               0x3
#define _B3SIDH_SID6_SIZE                                   0x1
#define _B3SIDH_SID6_LENGTH                                 0x1
#define _B3SIDH_SID6_MASK                                   0x8
#define _B3SIDH_SID7_POSN                                   0x4
#define _B3SIDH_SID7_POSITION                               0x4
#define _B3SIDH_SID7_SIZE                                   0x1
#define _B3SIDH_SID7_LENGTH                                 0x1
#define _B3SIDH_SID7_MASK                                   0x10
#define _B3SIDH_SID8_POSN                                   0x5
#define _B3SIDH_SID8_POSITION                               0x5
#define _B3SIDH_SID8_SIZE                                   0x1
#define _B3SIDH_SID8_LENGTH                                 0x1
#define _B3SIDH_SID8_MASK                                   0x20
#define _B3SIDH_SID9_POSN                                   0x6
#define _B3SIDH_SID9_POSITION                               0x6
#define _B3SIDH_SID9_SIZE                                   0x1
#define _B3SIDH_SID9_LENGTH                                 0x1
#define _B3SIDH_SID9_MASK                                   0x40
#define _B3SIDH_SID10_POSN                                  0x7
#define _B3SIDH_SID10_POSITION                              0x7
#define _B3SIDH_SID10_SIZE                                  0x1
#define _B3SIDH_SID10_LENGTH                                0x1
#define _B3SIDH_SID10_MASK                                  0x80
#define _B3SIDH_B3SID3_POSN                                 0x0
#define _B3SIDH_B3SID3_POSITION                             0x0
#define _B3SIDH_B3SID3_SIZE                                 0x1
#define _B3SIDH_B3SID3_LENGTH                               0x1
#define _B3SIDH_B3SID3_MASK                                 0x1
#define _B3SIDH_B3SID4_POSN                                 0x1
#define _B3SIDH_B3SID4_POSITION                             0x1
#define _B3SIDH_B3SID4_SIZE                                 0x1
#define _B3SIDH_B3SID4_LENGTH                               0x1
#define _B3SIDH_B3SID4_MASK                                 0x2
#define _B3SIDH_B3SID5_POSN                                 0x2
#define _B3SIDH_B3SID5_POSITION                             0x2
#define _B3SIDH_B3SID5_SIZE                                 0x1
#define _B3SIDH_B3SID5_LENGTH                               0x1
#define _B3SIDH_B3SID5_MASK                                 0x4
#define _B3SIDH_B3SID6_POSN                                 0x3
#define _B3SIDH_B3SID6_POSITION                             0x3
#define _B3SIDH_B3SID6_SIZE                                 0x1
#define _B3SIDH_B3SID6_LENGTH                               0x1
#define _B3SIDH_B3SID6_MASK                                 0x8
#define _B3SIDH_B3SID7_POSN                                 0x4
#define _B3SIDH_B3SID7_POSITION                             0x4
#define _B3SIDH_B3SID7_SIZE                                 0x1
#define _B3SIDH_B3SID7_LENGTH                               0x1
#define _B3SIDH_B3SID7_MASK                                 0x10
#define _B3SIDH_B3SID8_POSN                                 0x5
#define _B3SIDH_B3SID8_POSITION                             0x5
#define _B3SIDH_B3SID8_SIZE                                 0x1
#define _B3SIDH_B3SID8_LENGTH                               0x1
#define _B3SIDH_B3SID8_MASK                                 0x20
#define _B3SIDH_B3SID9_POSN                                 0x6
#define _B3SIDH_B3SID9_POSITION                             0x6
#define _B3SIDH_B3SID9_SIZE                                 0x1
#define _B3SIDH_B3SID9_LENGTH                               0x1
#define _B3SIDH_B3SID9_MASK                                 0x40
#define _B3SIDH_B3SID10_POSN                                0x7
#define _B3SIDH_B3SID10_POSITION                            0x7
#define _B3SIDH_B3SID10_SIZE                                0x1
#define _B3SIDH_B3SID10_LENGTH                              0x1
#define _B3SIDH_B3SID10_MASK                                0x80

