MikroElektronika/core_packages/PIC/XC8/def/PIC18F2682/mcu.h
extern volatile RXF5EIDLbits_t RXF5EIDLbits __at(0xF17);
// bitfield macros
#define _RXF5EIDL_EID0_POSN                                 0x0
#define _RXF5EIDL_EID0_POSITION                             0x0
#define _RXF5EIDL_EID0_SIZE                                 0x1
#define _RXF5EIDL_EID0_LENGTH                               0x1
#define _RXF5EIDL_EID0_MASK                                 0x1
#define _RXF5EIDL_EID1_POSN                                 0x1
#define _RXF5EIDL_EID1_POSITION                             0x1
#define _RXF5EIDL_EID1_SIZE                                 0x1
#define _RXF5EIDL_EID1_LENGTH                               0x1
#define _RXF5EIDL_EID1_MASK                                 0x2
#define _RXF5EIDL_EID2_POSN                                 0x2
#define _RXF5EIDL_EID2_POSITION                             0x2
#define _RXF5EIDL_EID2_SIZE                                 0x1
#define _RXF5EIDL_EID2_LENGTH                               0x1
#define _RXF5EIDL_EID2_MASK                                 0x4
#define _RXF5EIDL_EID3_POSN                                 0x3
#define _RXF5EIDL_EID3_POSITION                             0x3
#define _RXF5EIDL_EID3_SIZE                                 0x1
#define _RXF5EIDL_EID3_LENGTH                               0x1
#define _RXF5EIDL_EID3_MASK                                 0x8
#define _RXF5EIDL_EID4_POSN                                 0x4
#define _RXF5EIDL_EID4_POSITION                             0x4
#define _RXF5EIDL_EID4_SIZE                                 0x1
#define _RXF5EIDL_EID4_LENGTH                               0x1
#define _RXF5EIDL_EID4_MASK                                 0x10
#define _RXF5EIDL_EID5_POSN                                 0x5
#define _RXF5EIDL_EID5_POSITION                             0x5
#define _RXF5EIDL_EID5_SIZE                                 0x1
#define _RXF5EIDL_EID5_LENGTH                               0x1
#define _RXF5EIDL_EID5_MASK                                 0x20
#define _RXF5EIDL_EID6_POSN                                 0x6
#define _RXF5EIDL_EID6_POSITION                             0x6
#define _RXF5EIDL_EID6_SIZE                                 0x1
#define _RXF5EIDL_EID6_LENGTH                               0x1
#define _RXF5EIDL_EID6_MASK                                 0x40
#define _RXF5EIDL_EID7_POSN                                 0x7
#define _RXF5EIDL_EID7_POSITION                             0x7
#define _RXF5EIDL_EID7_SIZE                                 0x1
#define _RXF5EIDL_EID7_LENGTH                               0x1
#define _RXF5EIDL_EID7_MASK                                 0x80
#define _RXF5EIDL_RXF5EID0_POSN                             0x0
#define _RXF5EIDL_RXF5EID0_POSITION                         0x0
#define _RXF5EIDL_RXF5EID0_SIZE                             0x1
#define _RXF5EIDL_RXF5EID0_LENGTH                           0x1
#define _RXF5EIDL_RXF5EID0_MASK                             0x1
#define _RXF5EIDL_RXF5EID1_POSN                             0x1
#define _RXF5EIDL_RXF5EID1_POSITION                         0x1
#define _RXF5EIDL_RXF5EID1_SIZE                             0x1
#define _RXF5EIDL_RXF5EID1_LENGTH                           0x1
#define _RXF5EIDL_RXF5EID1_MASK                             0x2
#define _RXF5EIDL_RXF5EID2_POSN                             0x2
#define _RXF5EIDL_RXF5EID2_POSITION                         0x2
#define _RXF5EIDL_RXF5EID2_SIZE                             0x1
#define _RXF5EIDL_RXF5EID2_LENGTH                           0x1
#define _RXF5EIDL_RXF5EID2_MASK                             0x4
#define _RXF5EIDL_RXF5EID3_POSN                             0x3
#define _RXF5EIDL_RXF5EID3_POSITION                         0x3
#define _RXF5EIDL_RXF5EID3_SIZE                             0x1
#define _RXF5EIDL_RXF5EID3_LENGTH                           0x1
#define _RXF5EIDL_RXF5EID3_MASK                             0x8
#define _RXF5EIDL_RXF5EID4_POSN                             0x4
#define _RXF5EIDL_RXF5EID4_POSITION                         0x4
#define _RXF5EIDL_RXF5EID4_SIZE                             0x1
#define _RXF5EIDL_RXF5EID4_LENGTH                           0x1
#define _RXF5EIDL_RXF5EID4_MASK                             0x10
#define _RXF5EIDL_RXF5EID5_POSN                             0x5
#define _RXF5EIDL_RXF5EID5_POSITION                         0x5
#define _RXF5EIDL_RXF5EID5_SIZE                             0x1
#define _RXF5EIDL_RXF5EID5_LENGTH                           0x1
#define _RXF5EIDL_RXF5EID5_MASK                             0x20
#define _RXF5EIDL_RXF5EID6_POSN                             0x6
#define _RXF5EIDL_RXF5EID6_POSITION                         0x6
#define _RXF5EIDL_RXF5EID6_SIZE                             0x1
#define _RXF5EIDL_RXF5EID6_LENGTH                           0x1
#define _RXF5EIDL_RXF5EID6_MASK                             0x40
#define _RXF5EIDL_RXF5EID7_POSN                             0x7
#define _RXF5EIDL_RXF5EID7_POSITION                         0x7
#define _RXF5EIDL_RXF5EID7_SIZE                             0x1
#define _RXF5EIDL_RXF5EID7_LENGTH                           0x1
#define _RXF5EIDL_RXF5EID7_MASK                             0x80

// Register: RXM0SIDH
#define RXM0SIDH RXM0SIDH
extern volatile unsigned char           RXM0SIDH            __at(0xF18);
#ifndef _LIB_BUILD
asm("RXM0SIDH equ 0F18h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXM0SID3               :1;
        unsigned RXM0SID4               :1;
        unsigned RXM0SID5               :1;
        unsigned RXM0SID6               :1;
        unsigned RXM0SID7               :1;
        unsigned RXM0SID8               :1;
        unsigned RXM0SID9               :1;
        unsigned RXM0SID10              :1;
    };
} RXM0SIDHbits_t;
extern volatile RXM0SIDHbits_t RXM0SIDHbits __at(0xF18);
// bitfield macros
#define _RXM0SIDH_SID3_POSN                                 0x0
#define _RXM0SIDH_SID3_POSITION                             0x0
#define _RXM0SIDH_SID3_SIZE                                 0x1
#define _RXM0SIDH_SID3_LENGTH                               0x1
#define _RXM0SIDH_SID3_MASK                                 0x1
#define _RXM0SIDH_SID4_POSN                                 0x1
#define _RXM0SIDH_SID4_POSITION                             0x1
#define _RXM0SIDH_SID4_SIZE                                 0x1
#define _RXM0SIDH_SID4_LENGTH                               0x1
#define _RXM0SIDH_SID4_MASK                                 0x2
#define _RXM0SIDH_SID5_POSN                                 0x2
#define _RXM0SIDH_SID5_POSITION                             0x2
#define _RXM0SIDH_SID5_SIZE                                 0x1
#define _RXM0SIDH_SID5_LENGTH                               0x1
#define _RXM0SIDH_SID5_MASK                                 0x4
#define _RXM0SIDH_SID6_POSN                                 0x3
#define _RXM0SIDH_SID6_POSITION                             0x3
#define _RXM0SIDH_SID6_SIZE                                 0x1
#define _RXM0SIDH_SID6_LENGTH                               0x1
#define _RXM0SIDH_SID6_MASK                                 0x8
#define _RXM0SIDH_SID7_POSN                                 0x4
#define _RXM0SIDH_SID7_POSITION                             0x4
#define _RXM0SIDH_SID7_SIZE                                 0x1
#define _RXM0SIDH_SID7_LENGTH                               0x1
#define _RXM0SIDH_SID7_MASK                                 0x10
#define _RXM0SIDH_SID8_POSN                                 0x5
#define _RXM0SIDH_SID8_POSITION                             0x5
#define _RXM0SIDH_SID8_SIZE                                 0x1
#define _RXM0SIDH_SID8_LENGTH                               0x1
#define _RXM0SIDH_SID8_MASK                                 0x20
#define _RXM0SIDH_SID9_POSN                                 0x6
#define _RXM0SIDH_SID9_POSITION                             0x6
#define _RXM0SIDH_SID9_SIZE                                 0x1
#define _RXM0SIDH_SID9_LENGTH                               0x1
#define _RXM0SIDH_SID9_MASK                                 0x40
#define _RXM0SIDH_SID10_POSN                                0x7
#define _RXM0SIDH_SID10_POSITION                            0x7
#define _RXM0SIDH_SID10_SIZE                                0x1
#define _RXM0SIDH_SID10_LENGTH                              0x1
#define _RXM0SIDH_SID10_MASK                                0x80
#define _RXM0SIDH_RXM0SID3_POSN                             0x0
#define _RXM0SIDH_RXM0SID3_POSITION                         0x0
#define _RXM0SIDH_RXM0SID3_SIZE                             0x1
#define _RXM0SIDH_RXM0SID3_LENGTH                           0x1
#define _RXM0SIDH_RXM0SID3_MASK                             0x1
#define _RXM0SIDH_RXM0SID4_POSN                             0x1
#define _RXM0SIDH_RXM0SID4_POSITION                         0x1
#define _RXM0SIDH_RXM0SID4_SIZE                             0x1
#define _RXM0SIDH_RXM0SID4_LENGTH                           0x1
#define _RXM0SIDH_RXM0SID4_MASK                             0x2
#define _RXM0SIDH_RXM0SID5_POSN                             0x2
#define _RXM0SIDH_RXM0SID5_POSITION                         0x2
#define _RXM0SIDH_RXM0SID5_SIZE                             0x1
#define _RXM0SIDH_RXM0SID5_LENGTH                           0x1
#define _RXM0SIDH_RXM0SID5_MASK                             0x4
#define _RXM0SIDH_RXM0SID6_POSN                             0x3
#define _RXM0SIDH_RXM0SID6_POSITION                         0x3
#define _RXM0SIDH_RXM0SID6_SIZE                             0x1
#define _RXM0SIDH_RXM0SID6_LENGTH                           0x1
#define _RXM0SIDH_RXM0SID6_MASK                             0x8
#define _RXM0SIDH_RXM0SID7_POSN                             0x4
#define _RXM0SIDH_RXM0SID7_POSITION                         0x4
#define _RXM0SIDH_RXM0SID7_SIZE                             0x1
#define _RXM0SIDH_RXM0SID7_LENGTH                           0x1
#define _RXM0SIDH_RXM0SID7_MASK                             0x10
#define _RXM0SIDH_RXM0SID8_POSN                             0x5
#define _RXM0SIDH_RXM0SID8_POSITION                         0x5
#define _RXM0SIDH_RXM0SID8_SIZE                             0x1
#define _RXM0SIDH_RXM0SID8_LENGTH                           0x1
#define _RXM0SIDH_RXM0SID8_MASK                             0x20
#define _RXM0SIDH_RXM0SID9_POSN                             0x6
#define _RXM0SIDH_RXM0SID9_POSITION                         0x6
#define _RXM0SIDH_RXM0SID9_SIZE                             0x1
#define _RXM0SIDH_RXM0SID9_LENGTH                           0x1
#define _RXM0SIDH_RXM0SID9_MASK                             0x40
#define _RXM0SIDH_RXM0SID10_POSN                            0x7
#define _RXM0SIDH_RXM0SID10_POSITION                        0x7
#define _RXM0SIDH_RXM0SID10_SIZE                            0x1
#define _RXM0SIDH_RXM0SID10_LENGTH                          0x1
#define _RXM0SIDH_RXM0SID10_MASK                            0x80

// Register: RXM0SIDL
#define RXM0SIDL RXM0SIDL
extern volatile unsigned char           RXM0SIDL            __at(0xF19);
#ifndef _LIB_BUILD
asm("RXM0SIDL equ 0F19h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :1;
        unsigned EXIDEN                 :1;
        unsigned                        :1;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned RXM0EID16              :1;
        unsigned RXM0EID17              :1;
        unsigned                        :1;
        unsigned RXM0EXIDM              :1;
        unsigned                        :1;
        unsigned RXM0SID0               :1;
        unsigned RXM0SID1               :1;
        unsigned RXM0SID2               :1;
    };
} RXM0SIDLbits_t;
extern volatile RXM0SIDLbits_t RXM0SIDLbits __at(0xF19);
// bitfield macros
#define _RXM0SIDL_EID16_POSN                                0x0
#define _RXM0SIDL_EID16_POSITION                            0x0
#define _RXM0SIDL_EID16_SIZE                                0x1
#define _RXM0SIDL_EID16_LENGTH                              0x1
#define _RXM0SIDL_EID16_MASK                                0x1
#define _RXM0SIDL_EID17_POSN                                0x1
#define _RXM0SIDL_EID17_POSITION                            0x1
#define _RXM0SIDL_EID17_SIZE                                0x1
#define _RXM0SIDL_EID17_LENGTH                              0x1
#define _RXM0SIDL_EID17_MASK                                0x2
#define _RXM0SIDL_EXIDEN_POSN                               0x3
#define _RXM0SIDL_EXIDEN_POSITION                           0x3
#define _RXM0SIDL_EXIDEN_SIZE                               0x1
#define _RXM0SIDL_EXIDEN_LENGTH                             0x1
#define _RXM0SIDL_EXIDEN_MASK                               0x8
#define _RXM0SIDL_SID0_POSN                                 0x5
#define _RXM0SIDL_SID0_POSITION                             0x5
#define _RXM0SIDL_SID0_SIZE                                 0x1
#define _RXM0SIDL_SID0_LENGTH                               0x1
#define _RXM0SIDL_SID0_MASK                                 0x20
#define _RXM0SIDL_SID1_POSN                                 0x6
#define _RXM0SIDL_SID1_POSITION                             0x6
#define _RXM0SIDL_SID1_SIZE                                 0x1
#define _RXM0SIDL_SID1_LENGTH                               0x1
#define _RXM0SIDL_SID1_MASK                                 0x40
#define _RXM0SIDL_SID2_POSN                                 0x7
#define _RXM0SIDL_SID2_POSITION                             0x7
#define _RXM0SIDL_SID2_SIZE                                 0x1
#define _RXM0SIDL_SID2_LENGTH                               0x1
#define _RXM0SIDL_SID2_MASK                                 0x80
#define _RXM0SIDL_RXM0EID16_POSN                            0x0
#define _RXM0SIDL_RXM0EID16_POSITION                        0x0
#define _RXM0SIDL_RXM0EID16_SIZE                            0x1
#define _RXM0SIDL_RXM0EID16_LENGTH                          0x1
#define _RXM0SIDL_RXM0EID16_MASK                            0x1
#define _RXM0SIDL_RXM0EID17_POSN                            0x1
#define _RXM0SIDL_RXM0EID17_POSITION                        0x1
#define _RXM0SIDL_RXM0EID17_SIZE                            0x1
#define _RXM0SIDL_RXM0EID17_LENGTH                          0x1
#define _RXM0SIDL_RXM0EID17_MASK                            0x2
#define _RXM0SIDL_RXM0EXIDM_POSN                            0x3
#define _RXM0SIDL_RXM0EXIDM_POSITION                        0x3
#define _RXM0SIDL_RXM0EXIDM_SIZE                            0x1
#define _RXM0SIDL_RXM0EXIDM_LENGTH                          0x1
#define _RXM0SIDL_RXM0EXIDM_MASK                            0x8
#define _RXM0SIDL_RXM0SID0_POSN                             0x5
#define _RXM0SIDL_RXM0SID0_POSITION                         0x5
#define _RXM0SIDL_RXM0SID0_SIZE                             0x1
#define _RXM0SIDL_RXM0SID0_LENGTH                           0x1
#define _RXM0SIDL_RXM0SID0_MASK                             0x20
#define _RXM0SIDL_RXM0SID1_POSN                             0x6
#define _RXM0SIDL_RXM0SID1_POSITION                         0x6
#define _RXM0SIDL_RXM0SID1_SIZE                             0x1
#define _RXM0SIDL_RXM0SID1_LENGTH                           0x1
#define _RXM0SIDL_RXM0SID1_MASK                             0x40
#define _RXM0SIDL_RXM0SID2_POSN                             0x7
#define _RXM0SIDL_RXM0SID2_POSITION                         0x7
#define _RXM0SIDL_RXM0SID2_SIZE                             0x1
#define _RXM0SIDL_RXM0SID2_LENGTH                           0x1
#define _RXM0SIDL_RXM0SID2_MASK                             0x80

