MikroElektronika/core_packages/PIC/XC8/def/PIC18F2682/mcu.h
// Register: RXM0EIDH
#define RXM0EIDH RXM0EIDH
extern volatile unsigned char           RXM0EIDH            __at(0xF1A);
#ifndef _LIB_BUILD
asm("RXM0EIDH equ 0F1Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID8                   :1;
        unsigned EID9                   :1;
        unsigned EID10                  :1;
        unsigned EID11                  :1;
        unsigned EID12                  :1;
        unsigned EID13                  :1;
        unsigned EID14                  :1;
        unsigned EID15                  :1;
    };
    struct {
        unsigned RXM0EID8               :1;
        unsigned RXM0EID9               :1;
        unsigned RXM0EID10              :1;
        unsigned RXM0EID11              :1;
        unsigned RXM0EID12              :1;
        unsigned RXM0EID13              :1;
        unsigned RXM0EID14              :1;
        unsigned RXM0EID15              :1;
    };
} RXM0EIDHbits_t;
extern volatile RXM0EIDHbits_t RXM0EIDHbits __at(0xF1A);
// bitfield macros
#define _RXM0EIDH_EID8_POSN                                 0x0
#define _RXM0EIDH_EID8_POSITION                             0x0
#define _RXM0EIDH_EID8_SIZE                                 0x1
#define _RXM0EIDH_EID8_LENGTH                               0x1
#define _RXM0EIDH_EID8_MASK                                 0x1
#define _RXM0EIDH_EID9_POSN                                 0x1
#define _RXM0EIDH_EID9_POSITION                             0x1
#define _RXM0EIDH_EID9_SIZE                                 0x1
#define _RXM0EIDH_EID9_LENGTH                               0x1
#define _RXM0EIDH_EID9_MASK                                 0x2
#define _RXM0EIDH_EID10_POSN                                0x2
#define _RXM0EIDH_EID10_POSITION                            0x2
#define _RXM0EIDH_EID10_SIZE                                0x1
#define _RXM0EIDH_EID10_LENGTH                              0x1
#define _RXM0EIDH_EID10_MASK                                0x4
#define _RXM0EIDH_EID11_POSN                                0x3
#define _RXM0EIDH_EID11_POSITION                            0x3
#define _RXM0EIDH_EID11_SIZE                                0x1
#define _RXM0EIDH_EID11_LENGTH                              0x1
#define _RXM0EIDH_EID11_MASK                                0x8
#define _RXM0EIDH_EID12_POSN                                0x4
#define _RXM0EIDH_EID12_POSITION                            0x4
#define _RXM0EIDH_EID12_SIZE                                0x1
#define _RXM0EIDH_EID12_LENGTH                              0x1
#define _RXM0EIDH_EID12_MASK                                0x10
#define _RXM0EIDH_EID13_POSN                                0x5
#define _RXM0EIDH_EID13_POSITION                            0x5
#define _RXM0EIDH_EID13_SIZE                                0x1
#define _RXM0EIDH_EID13_LENGTH                              0x1
#define _RXM0EIDH_EID13_MASK                                0x20
#define _RXM0EIDH_EID14_POSN                                0x6
#define _RXM0EIDH_EID14_POSITION                            0x6
#define _RXM0EIDH_EID14_SIZE                                0x1
#define _RXM0EIDH_EID14_LENGTH                              0x1
#define _RXM0EIDH_EID14_MASK                                0x40
#define _RXM0EIDH_EID15_POSN                                0x7
#define _RXM0EIDH_EID15_POSITION                            0x7
#define _RXM0EIDH_EID15_SIZE                                0x1
#define _RXM0EIDH_EID15_LENGTH                              0x1
#define _RXM0EIDH_EID15_MASK                                0x80
#define _RXM0EIDH_RXM0EID8_POSN                             0x0
#define _RXM0EIDH_RXM0EID8_POSITION                         0x0
#define _RXM0EIDH_RXM0EID8_SIZE                             0x1
#define _RXM0EIDH_RXM0EID8_LENGTH                           0x1
#define _RXM0EIDH_RXM0EID8_MASK                             0x1
#define _RXM0EIDH_RXM0EID9_POSN                             0x1
#define _RXM0EIDH_RXM0EID9_POSITION                         0x1
#define _RXM0EIDH_RXM0EID9_SIZE                             0x1
#define _RXM0EIDH_RXM0EID9_LENGTH                           0x1
#define _RXM0EIDH_RXM0EID9_MASK                             0x2
#define _RXM0EIDH_RXM0EID10_POSN                            0x2
#define _RXM0EIDH_RXM0EID10_POSITION                        0x2
#define _RXM0EIDH_RXM0EID10_SIZE                            0x1
#define _RXM0EIDH_RXM0EID10_LENGTH                          0x1
#define _RXM0EIDH_RXM0EID10_MASK                            0x4
#define _RXM0EIDH_RXM0EID11_POSN                            0x3
#define _RXM0EIDH_RXM0EID11_POSITION                        0x3
#define _RXM0EIDH_RXM0EID11_SIZE                            0x1
#define _RXM0EIDH_RXM0EID11_LENGTH                          0x1
#define _RXM0EIDH_RXM0EID11_MASK                            0x8
#define _RXM0EIDH_RXM0EID12_POSN                            0x4
#define _RXM0EIDH_RXM0EID12_POSITION                        0x4
#define _RXM0EIDH_RXM0EID12_SIZE                            0x1
#define _RXM0EIDH_RXM0EID12_LENGTH                          0x1
#define _RXM0EIDH_RXM0EID12_MASK                            0x10
#define _RXM0EIDH_RXM0EID13_POSN                            0x5
#define _RXM0EIDH_RXM0EID13_POSITION                        0x5
#define _RXM0EIDH_RXM0EID13_SIZE                            0x1
#define _RXM0EIDH_RXM0EID13_LENGTH                          0x1
#define _RXM0EIDH_RXM0EID13_MASK                            0x20
#define _RXM0EIDH_RXM0EID14_POSN                            0x6
#define _RXM0EIDH_RXM0EID14_POSITION                        0x6
#define _RXM0EIDH_RXM0EID14_SIZE                            0x1
#define _RXM0EIDH_RXM0EID14_LENGTH                          0x1
#define _RXM0EIDH_RXM0EID14_MASK                            0x40
#define _RXM0EIDH_RXM0EID15_POSN                            0x7
#define _RXM0EIDH_RXM0EID15_POSITION                        0x7
#define _RXM0EIDH_RXM0EID15_SIZE                            0x1
#define _RXM0EIDH_RXM0EID15_LENGTH                          0x1
#define _RXM0EIDH_RXM0EID15_MASK                            0x80

// Register: RXM0EIDL
#define RXM0EIDL RXM0EIDL
extern volatile unsigned char           RXM0EIDL            __at(0xF1B);
#ifndef _LIB_BUILD
asm("RXM0EIDL equ 0F1Bh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID0                   :1;
        unsigned EID1                   :1;
        unsigned EID2                   :1;
        unsigned EID3                   :1;
        unsigned EID4                   :1;
        unsigned EID5                   :1;
        unsigned EID6                   :1;
        unsigned EID7                   :1;
    };
    struct {
        unsigned RXM0EID0               :1;
        unsigned RXM0EID1               :1;
        unsigned RXM0EID2               :1;
        unsigned RXM0EID3               :1;
        unsigned RXM0EID4               :1;
        unsigned RXM0EID5               :1;
        unsigned RXM0EID6               :1;
        unsigned RXM0EID7               :1;
    };
} RXM0EIDLbits_t;
extern volatile RXM0EIDLbits_t RXM0EIDLbits __at(0xF1B);
// bitfield macros
#define _RXM0EIDL_EID0_POSN                                 0x0
#define _RXM0EIDL_EID0_POSITION                             0x0
#define _RXM0EIDL_EID0_SIZE                                 0x1
#define _RXM0EIDL_EID0_LENGTH                               0x1
#define _RXM0EIDL_EID0_MASK                                 0x1
#define _RXM0EIDL_EID1_POSN                                 0x1
#define _RXM0EIDL_EID1_POSITION                             0x1
#define _RXM0EIDL_EID1_SIZE                                 0x1
#define _RXM0EIDL_EID1_LENGTH                               0x1
#define _RXM0EIDL_EID1_MASK                                 0x2
#define _RXM0EIDL_EID2_POSN                                 0x2
#define _RXM0EIDL_EID2_POSITION                             0x2
#define _RXM0EIDL_EID2_SIZE                                 0x1
#define _RXM0EIDL_EID2_LENGTH                               0x1
#define _RXM0EIDL_EID2_MASK                                 0x4
#define _RXM0EIDL_EID3_POSN                                 0x3
#define _RXM0EIDL_EID3_POSITION                             0x3
#define _RXM0EIDL_EID3_SIZE                                 0x1
#define _RXM0EIDL_EID3_LENGTH                               0x1
#define _RXM0EIDL_EID3_MASK                                 0x8
#define _RXM0EIDL_EID4_POSN                                 0x4
#define _RXM0EIDL_EID4_POSITION                             0x4
#define _RXM0EIDL_EID4_SIZE                                 0x1
#define _RXM0EIDL_EID4_LENGTH                               0x1
#define _RXM0EIDL_EID4_MASK                                 0x10
#define _RXM0EIDL_EID5_POSN                                 0x5
#define _RXM0EIDL_EID5_POSITION                             0x5
#define _RXM0EIDL_EID5_SIZE                                 0x1
#define _RXM0EIDL_EID5_LENGTH                               0x1
#define _RXM0EIDL_EID5_MASK                                 0x20
#define _RXM0EIDL_EID6_POSN                                 0x6
#define _RXM0EIDL_EID6_POSITION                             0x6
#define _RXM0EIDL_EID6_SIZE                                 0x1
#define _RXM0EIDL_EID6_LENGTH                               0x1
#define _RXM0EIDL_EID6_MASK                                 0x40
#define _RXM0EIDL_EID7_POSN                                 0x7
#define _RXM0EIDL_EID7_POSITION                             0x7
#define _RXM0EIDL_EID7_SIZE                                 0x1
#define _RXM0EIDL_EID7_LENGTH                               0x1
#define _RXM0EIDL_EID7_MASK                                 0x80
#define _RXM0EIDL_RXM0EID0_POSN                             0x0
#define _RXM0EIDL_RXM0EID0_POSITION                         0x0
#define _RXM0EIDL_RXM0EID0_SIZE                             0x1
#define _RXM0EIDL_RXM0EID0_LENGTH                           0x1
#define _RXM0EIDL_RXM0EID0_MASK                             0x1
#define _RXM0EIDL_RXM0EID1_POSN                             0x1
#define _RXM0EIDL_RXM0EID1_POSITION                         0x1
#define _RXM0EIDL_RXM0EID1_SIZE                             0x1
#define _RXM0EIDL_RXM0EID1_LENGTH                           0x1
#define _RXM0EIDL_RXM0EID1_MASK                             0x2
#define _RXM0EIDL_RXM0EID2_POSN                             0x2
#define _RXM0EIDL_RXM0EID2_POSITION                         0x2
#define _RXM0EIDL_RXM0EID2_SIZE                             0x1
#define _RXM0EIDL_RXM0EID2_LENGTH                           0x1
#define _RXM0EIDL_RXM0EID2_MASK                             0x4
#define _RXM0EIDL_RXM0EID3_POSN                             0x3
#define _RXM0EIDL_RXM0EID3_POSITION                         0x3
#define _RXM0EIDL_RXM0EID3_SIZE                             0x1
#define _RXM0EIDL_RXM0EID3_LENGTH                           0x1
#define _RXM0EIDL_RXM0EID3_MASK                             0x8
#define _RXM0EIDL_RXM0EID4_POSN                             0x4
#define _RXM0EIDL_RXM0EID4_POSITION                         0x4
#define _RXM0EIDL_RXM0EID4_SIZE                             0x1
#define _RXM0EIDL_RXM0EID4_LENGTH                           0x1
#define _RXM0EIDL_RXM0EID4_MASK                             0x10
#define _RXM0EIDL_RXM0EID5_POSN                             0x5
#define _RXM0EIDL_RXM0EID5_POSITION                         0x5
#define _RXM0EIDL_RXM0EID5_SIZE                             0x1
#define _RXM0EIDL_RXM0EID5_LENGTH                           0x1
#define _RXM0EIDL_RXM0EID5_MASK                             0x20
#define _RXM0EIDL_RXM0EID6_POSN                             0x6
#define _RXM0EIDL_RXM0EID6_POSITION                         0x6
#define _RXM0EIDL_RXM0EID6_SIZE                             0x1
#define _RXM0EIDL_RXM0EID6_LENGTH                           0x1
#define _RXM0EIDL_RXM0EID6_MASK                             0x40
#define _RXM0EIDL_RXM0EID7_POSN                             0x7
#define _RXM0EIDL_RXM0EID7_POSITION                         0x7
#define _RXM0EIDL_RXM0EID7_SIZE                             0x1
#define _RXM0EIDL_RXM0EID7_LENGTH                           0x1
#define _RXM0EIDL_RXM0EID7_MASK                             0x80

// Register: RXM1SIDH
#define RXM1SIDH RXM1SIDH
extern volatile unsigned char           RXM1SIDH            __at(0xF1C);
#ifndef _LIB_BUILD
asm("RXM1SIDH equ 0F1Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SID3                   :1;
        unsigned SID4                   :1;
        unsigned SID5                   :1;
        unsigned SID6                   :1;
        unsigned SID7                   :1;
        unsigned SID8                   :1;
        unsigned SID9                   :1;
        unsigned SID10                  :1;
    };
    struct {
        unsigned RXM1SID3               :1;
        unsigned RXM1SID4               :1;
        unsigned RXM1SID5               :1;
        unsigned RXM1SID6               :1;
        unsigned RXM1SID7               :1;
        unsigned RXM1SID8               :1;
        unsigned RXM1SID9               :1;
        unsigned RXM1SID10              :1;
    };
} RXM1SIDHbits_t;
extern volatile RXM1SIDHbits_t RXM1SIDHbits __at(0xF1C);
// bitfield macros
#define _RXM1SIDH_SID3_POSN                                 0x0
#define _RXM1SIDH_SID3_POSITION                             0x0
#define _RXM1SIDH_SID3_SIZE                                 0x1
#define _RXM1SIDH_SID3_LENGTH                               0x1
#define _RXM1SIDH_SID3_MASK                                 0x1
#define _RXM1SIDH_SID4_POSN                                 0x1
#define _RXM1SIDH_SID4_POSITION                             0x1
#define _RXM1SIDH_SID4_SIZE                                 0x1
#define _RXM1SIDH_SID4_LENGTH                               0x1
#define _RXM1SIDH_SID4_MASK                                 0x2
#define _RXM1SIDH_SID5_POSN                                 0x2
#define _RXM1SIDH_SID5_POSITION                             0x2
#define _RXM1SIDH_SID5_SIZE                                 0x1
#define _RXM1SIDH_SID5_LENGTH                               0x1
#define _RXM1SIDH_SID5_MASK                                 0x4
#define _RXM1SIDH_SID6_POSN                                 0x3
#define _RXM1SIDH_SID6_POSITION                             0x3
#define _RXM1SIDH_SID6_SIZE                                 0x1
#define _RXM1SIDH_SID6_LENGTH                               0x1
#define _RXM1SIDH_SID6_MASK                                 0x8
#define _RXM1SIDH_SID7_POSN                                 0x4
#define _RXM1SIDH_SID7_POSITION                             0x4
#define _RXM1SIDH_SID7_SIZE                                 0x1
#define _RXM1SIDH_SID7_LENGTH                               0x1
#define _RXM1SIDH_SID7_MASK                                 0x10
#define _RXM1SIDH_SID8_POSN                                 0x5
#define _RXM1SIDH_SID8_POSITION                             0x5
#define _RXM1SIDH_SID8_SIZE                                 0x1
#define _RXM1SIDH_SID8_LENGTH                               0x1
#define _RXM1SIDH_SID8_MASK                                 0x20
#define _RXM1SIDH_SID9_POSN                                 0x6
#define _RXM1SIDH_SID9_POSITION                             0x6
#define _RXM1SIDH_SID9_SIZE                                 0x1
#define _RXM1SIDH_SID9_LENGTH                               0x1
#define _RXM1SIDH_SID9_MASK                                 0x40
#define _RXM1SIDH_SID10_POSN                                0x7
#define _RXM1SIDH_SID10_POSITION                            0x7
#define _RXM1SIDH_SID10_SIZE                                0x1
#define _RXM1SIDH_SID10_LENGTH                              0x1
#define _RXM1SIDH_SID10_MASK                                0x80
#define _RXM1SIDH_RXM1SID3_POSN                             0x0
#define _RXM1SIDH_RXM1SID3_POSITION                         0x0
#define _RXM1SIDH_RXM1SID3_SIZE                             0x1
#define _RXM1SIDH_RXM1SID3_LENGTH                           0x1
#define _RXM1SIDH_RXM1SID3_MASK                             0x1
#define _RXM1SIDH_RXM1SID4_POSN                             0x1
#define _RXM1SIDH_RXM1SID4_POSITION                         0x1
#define _RXM1SIDH_RXM1SID4_SIZE                             0x1
#define _RXM1SIDH_RXM1SID4_LENGTH                           0x1
#define _RXM1SIDH_RXM1SID4_MASK                             0x2
#define _RXM1SIDH_RXM1SID5_POSN                             0x2
#define _RXM1SIDH_RXM1SID5_POSITION                         0x2
#define _RXM1SIDH_RXM1SID5_SIZE                             0x1
#define _RXM1SIDH_RXM1SID5_LENGTH                           0x1
#define _RXM1SIDH_RXM1SID5_MASK                             0x4
#define _RXM1SIDH_RXM1SID6_POSN                             0x3
#define _RXM1SIDH_RXM1SID6_POSITION                         0x3
#define _RXM1SIDH_RXM1SID6_SIZE                             0x1
#define _RXM1SIDH_RXM1SID6_LENGTH                           0x1
#define _RXM1SIDH_RXM1SID6_MASK                             0x8
#define _RXM1SIDH_RXM1SID7_POSN                             0x4
#define _RXM1SIDH_RXM1SID7_POSITION                         0x4
#define _RXM1SIDH_RXM1SID7_SIZE                             0x1
#define _RXM1SIDH_RXM1SID7_LENGTH                           0x1
#define _RXM1SIDH_RXM1SID7_MASK                             0x10
#define _RXM1SIDH_RXM1SID8_POSN                             0x5
#define _RXM1SIDH_RXM1SID8_POSITION                         0x5
#define _RXM1SIDH_RXM1SID8_SIZE                             0x1
#define _RXM1SIDH_RXM1SID8_LENGTH                           0x1
#define _RXM1SIDH_RXM1SID8_MASK                             0x20
#define _RXM1SIDH_RXM1SID9_POSN                             0x6
#define _RXM1SIDH_RXM1SID9_POSITION                         0x6
#define _RXM1SIDH_RXM1SID9_SIZE                             0x1
#define _RXM1SIDH_RXM1SID9_LENGTH                           0x1
#define _RXM1SIDH_RXM1SID9_MASK                             0x40
#define _RXM1SIDH_RXM1SID10_POSN                            0x7
#define _RXM1SIDH_RXM1SID10_POSITION                        0x7
#define _RXM1SIDH_RXM1SID10_SIZE                            0x1
#define _RXM1SIDH_RXM1SID10_LENGTH                          0x1
#define _RXM1SIDH_RXM1SID10_MASK                            0x80

// Register: RXM1SIDL
#define RXM1SIDL RXM1SIDL
extern volatile unsigned char           RXM1SIDL            __at(0xF1D);
#ifndef _LIB_BUILD
asm("RXM1SIDL equ 0F1Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned EID16                  :1;
        unsigned EID17                  :1;
        unsigned                        :1;
        unsigned EXIDEN                 :1;
        unsigned                        :1;
        unsigned SID0                   :1;
        unsigned SID1                   :1;
        unsigned SID2                   :1;
    };
    struct {
        unsigned RXM1EID16              :1;
        unsigned RXM1EID17              :1;
        unsigned                        :1;
        unsigned RXM1EXIDEN             :1;
        unsigned                        :1;
        unsigned RXM1SID0               :1;
        unsigned RXM1SID1               :1;
        unsigned RXM1SID2               :1;
    };
} RXM1SIDLbits_t;
extern volatile RXM1SIDLbits_t RXM1SIDLbits __at(0xF1D);
// bitfield macros
#define _RXM1SIDL_EID16_POSN                                0x0
#define _RXM1SIDL_EID16_POSITION                            0x0
#define _RXM1SIDL_EID16_SIZE                                0x1
#define _RXM1SIDL_EID16_LENGTH                              0x1
#define _RXM1SIDL_EID16_MASK                                0x1
#define _RXM1SIDL_EID17_POSN                                0x1
#define _RXM1SIDL_EID17_POSITION                            0x1
#define _RXM1SIDL_EID17_SIZE                                0x1
#define _RXM1SIDL_EID17_LENGTH                              0x1
#define _RXM1SIDL_EID17_MASK                                0x2
#define _RXM1SIDL_EXIDEN_POSN                               0x3
#define _RXM1SIDL_EXIDEN_POSITION                           0x3
#define _RXM1SIDL_EXIDEN_SIZE                               0x1
#define _RXM1SIDL_EXIDEN_LENGTH                             0x1
#define _RXM1SIDL_EXIDEN_MASK                               0x8
#define _RXM1SIDL_SID0_POSN                                 0x5
#define _RXM1SIDL_SID0_POSITION                             0x5
#define _RXM1SIDL_SID0_SIZE                                 0x1
#define _RXM1SIDL_SID0_LENGTH                               0x1
#define _RXM1SIDL_SID0_MASK                                 0x20
#define _RXM1SIDL_SID1_POSN                                 0x6
#define _RXM1SIDL_SID1_POSITION                             0x6
#define _RXM1SIDL_SID1_SIZE                                 0x1
#define _RXM1SIDL_SID1_LENGTH                               0x1
#define _RXM1SIDL_SID1_MASK                                 0x40
#define _RXM1SIDL_SID2_POSN                                 0x7
#define _RXM1SIDL_SID2_POSITION                             0x7
#define _RXM1SIDL_SID2_SIZE                                 0x1
#define _RXM1SIDL_SID2_LENGTH                               0x1
#define _RXM1SIDL_SID2_MASK                                 0x80
#define _RXM1SIDL_RXM1EID16_POSN                            0x0
#define _RXM1SIDL_RXM1EID16_POSITION                        0x0
#define _RXM1SIDL_RXM1EID16_SIZE                            0x1
#define _RXM1SIDL_RXM1EID16_LENGTH                          0x1
#define _RXM1SIDL_RXM1EID16_MASK                            0x1
#define _RXM1SIDL_RXM1EID17_POSN                            0x1
#define _RXM1SIDL_RXM1EID17_POSITION                        0x1
#define _RXM1SIDL_RXM1EID17_SIZE                            0x1
#define _RXM1SIDL_RXM1EID17_LENGTH                          0x1
#define _RXM1SIDL_RXM1EID17_MASK                            0x2
#define _RXM1SIDL_RXM1EXIDEN_POSN                           0x3
#define _RXM1SIDL_RXM1EXIDEN_POSITION                       0x3
#define _RXM1SIDL_RXM1EXIDEN_SIZE                           0x1
#define _RXM1SIDL_RXM1EXIDEN_LENGTH                         0x1
#define _RXM1SIDL_RXM1EXIDEN_MASK                           0x8
#define _RXM1SIDL_RXM1SID0_POSN                             0x5
#define _RXM1SIDL_RXM1SID0_POSITION                         0x5
#define _RXM1SIDL_RXM1SID0_SIZE                             0x1
#define _RXM1SIDL_RXM1SID0_LENGTH                           0x1
#define _RXM1SIDL_RXM1SID0_MASK                             0x20
#define _RXM1SIDL_RXM1SID1_POSN                             0x6
#define _RXM1SIDL_RXM1SID1_POSITION                         0x6
#define _RXM1SIDL_RXM1SID1_SIZE                             0x1
#define _RXM1SIDL_RXM1SID1_LENGTH                           0x1
#define _RXM1SIDL_RXM1SID1_MASK                             0x40
#define _RXM1SIDL_RXM1SID2_POSN                             0x7
#define _RXM1SIDL_RXM1SID2_POSITION                         0x7
#define _RXM1SIDL_RXM1SID2_SIZE                             0x1
#define _RXM1SIDL_RXM1SID2_LENGTH                           0x1
#define _RXM1SIDL_RXM1SID2_MASK                             0x80

