MikroElektronika/core_packages/PIC/XC8/def/PIC18F2682/mcu.h
// Register: TXB2DLC
#define TXB2DLC TXB2DLC
extern volatile unsigned char           TXB2DLC             __at(0xF25);
#ifndef _LIB_BUILD
asm("TXB2DLC equ 0F25h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned DLC0                   :1;
        unsigned DLC1                   :1;
        unsigned DLC2                   :1;
        unsigned DLC3                   :1;
        unsigned                        :2;
        unsigned TXRTR                  :1;
    };
    struct {
        unsigned TXB2DLC0               :1;
        unsigned TXB2DLC1               :1;
        unsigned TXB2DLC2               :1;
        unsigned TXB2DLC3               :1;
        unsigned                        :2;
        unsigned TXB2RTR                :1;
    };
} TXB2DLCbits_t;
extern volatile TXB2DLCbits_t TXB2DLCbits __at(0xF25);
// bitfield macros
#define _TXB2DLC_DLC0_POSN                                  0x0
#define _TXB2DLC_DLC0_POSITION                              0x0
#define _TXB2DLC_DLC0_SIZE                                  0x1
#define _TXB2DLC_DLC0_LENGTH                                0x1
#define _TXB2DLC_DLC0_MASK                                  0x1
#define _TXB2DLC_DLC1_POSN                                  0x1
#define _TXB2DLC_DLC1_POSITION                              0x1
#define _TXB2DLC_DLC1_SIZE                                  0x1
#define _TXB2DLC_DLC1_LENGTH                                0x1
#define _TXB2DLC_DLC1_MASK                                  0x2
#define _TXB2DLC_DLC2_POSN                                  0x2
#define _TXB2DLC_DLC2_POSITION                              0x2
#define _TXB2DLC_DLC2_SIZE                                  0x1
#define _TXB2DLC_DLC2_LENGTH                                0x1
#define _TXB2DLC_DLC2_MASK                                  0x4
#define _TXB2DLC_DLC3_POSN                                  0x3
#define _TXB2DLC_DLC3_POSITION                              0x3
#define _TXB2DLC_DLC3_SIZE                                  0x1
#define _TXB2DLC_DLC3_LENGTH                                0x1
#define _TXB2DLC_DLC3_MASK                                  0x8
#define _TXB2DLC_TXRTR_POSN                                 0x6
#define _TXB2DLC_TXRTR_POSITION                             0x6
#define _TXB2DLC_TXRTR_SIZE                                 0x1
#define _TXB2DLC_TXRTR_LENGTH                               0x1
#define _TXB2DLC_TXRTR_MASK                                 0x40
#define _TXB2DLC_TXB2DLC0_POSN                              0x0
#define _TXB2DLC_TXB2DLC0_POSITION                          0x0
#define _TXB2DLC_TXB2DLC0_SIZE                              0x1
#define _TXB2DLC_TXB2DLC0_LENGTH                            0x1
#define _TXB2DLC_TXB2DLC0_MASK                              0x1
#define _TXB2DLC_TXB2DLC1_POSN                              0x1
#define _TXB2DLC_TXB2DLC1_POSITION                          0x1
#define _TXB2DLC_TXB2DLC1_SIZE                              0x1
#define _TXB2DLC_TXB2DLC1_LENGTH                            0x1
#define _TXB2DLC_TXB2DLC1_MASK                              0x2
#define _TXB2DLC_TXB2DLC2_POSN                              0x2
#define _TXB2DLC_TXB2DLC2_POSITION                          0x2
#define _TXB2DLC_TXB2DLC2_SIZE                              0x1
#define _TXB2DLC_TXB2DLC2_LENGTH                            0x1
#define _TXB2DLC_TXB2DLC2_MASK                              0x4
#define _TXB2DLC_TXB2DLC3_POSN                              0x3
#define _TXB2DLC_TXB2DLC3_POSITION                          0x3
#define _TXB2DLC_TXB2DLC3_SIZE                              0x1
#define _TXB2DLC_TXB2DLC3_LENGTH                            0x1
#define _TXB2DLC_TXB2DLC3_MASK                              0x8
#define _TXB2DLC_TXB2RTR_POSN                               0x6
#define _TXB2DLC_TXB2RTR_POSITION                           0x6
#define _TXB2DLC_TXB2RTR_SIZE                               0x1
#define _TXB2DLC_TXB2RTR_LENGTH                             0x1
#define _TXB2DLC_TXB2RTR_MASK                               0x40

// Register: TXB2D0
#define TXB2D0 TXB2D0
extern volatile unsigned char           TXB2D0              __at(0xF26);
#ifndef _LIB_BUILD
asm("TXB2D0 equ 0F26h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TXB2D00                :1;
        unsigned TXB2D01                :1;
        unsigned TXB2D02                :1;
        unsigned TXB2D03                :1;
        unsigned TXB2D04                :1;
        unsigned TXB2D05                :1;
        unsigned TXB2D06                :1;
        unsigned TXB2D07                :1;
    };
} TXB2D0bits_t;
extern volatile TXB2D0bits_t TXB2D0bits __at(0xF26);
// bitfield macros
#define _TXB2D0_TXB2D00_POSN                                0x0
#define _TXB2D0_TXB2D00_POSITION                            0x0
#define _TXB2D0_TXB2D00_SIZE                                0x1
#define _TXB2D0_TXB2D00_LENGTH                              0x1
#define _TXB2D0_TXB2D00_MASK                                0x1
#define _TXB2D0_TXB2D01_POSN                                0x1
#define _TXB2D0_TXB2D01_POSITION                            0x1
#define _TXB2D0_TXB2D01_SIZE                                0x1
#define _TXB2D0_TXB2D01_LENGTH                              0x1
#define _TXB2D0_TXB2D01_MASK                                0x2
#define _TXB2D0_TXB2D02_POSN                                0x2
#define _TXB2D0_TXB2D02_POSITION                            0x2
#define _TXB2D0_TXB2D02_SIZE                                0x1
#define _TXB2D0_TXB2D02_LENGTH                              0x1
#define _TXB2D0_TXB2D02_MASK                                0x4
#define _TXB2D0_TXB2D03_POSN                                0x3
#define _TXB2D0_TXB2D03_POSITION                            0x3
#define _TXB2D0_TXB2D03_SIZE                                0x1
#define _TXB2D0_TXB2D03_LENGTH                              0x1
#define _TXB2D0_TXB2D03_MASK                                0x8
#define _TXB2D0_TXB2D04_POSN                                0x4
#define _TXB2D0_TXB2D04_POSITION                            0x4
#define _TXB2D0_TXB2D04_SIZE                                0x1
#define _TXB2D0_TXB2D04_LENGTH                              0x1
#define _TXB2D0_TXB2D04_MASK                                0x10
#define _TXB2D0_TXB2D05_POSN                                0x5
#define _TXB2D0_TXB2D05_POSITION                            0x5
#define _TXB2D0_TXB2D05_SIZE                                0x1
#define _TXB2D0_TXB2D05_LENGTH                              0x1
#define _TXB2D0_TXB2D05_MASK                                0x20
#define _TXB2D0_TXB2D06_POSN                                0x6
#define _TXB2D0_TXB2D06_POSITION                            0x6
#define _TXB2D0_TXB2D06_SIZE                                0x1
#define _TXB2D0_TXB2D06_LENGTH                              0x1
#define _TXB2D0_TXB2D06_MASK                                0x40
#define _TXB2D0_TXB2D07_POSN                                0x7
#define _TXB2D0_TXB2D07_POSITION                            0x7
#define _TXB2D0_TXB2D07_SIZE                                0x1
#define _TXB2D0_TXB2D07_LENGTH                              0x1
#define _TXB2D0_TXB2D07_MASK                                0x80

